---
kind: method
id: M:Autodesk.Revit.Exceptions.ModificationOutsideTransactionException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/482c21c8-75ef-0a05-4c5e-a220973b8fde.htm
---
# Autodesk.Revit.Exceptions.ModificationOutsideTransactionException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.